import {realm} from './realmConnection';

function writeData (){
    realm.write(() => {
      realm.create('Books' , {
          id : 0,
          name : 'هری پاتر',
          categoryAge : 2,
          categorySubject : 1,
          abstraction : 'هری پاتر نمی داند که چقدر مشهور است؛ چرا که با خاله و شوهر خاله بداخلاقش زندگی می کند و سالهاست که از بد رفتاری آنها رنج می برد. آنها وقتی متوجه شدند که هری کوچک هم درست مانند پدر و مادر خود واقعاً جادوگر است، از او خیلی می ترسند و سالهاست که سعی در انکار حقیقت دارند. اما همه چیز خیلی زود از زمانی برای هری تغییر می کند که نامه دعوت به تحصیل در مدرسه مخصوص جادوگران برای او ارسال می شود و کاوش او برای پی بردن به حقایق گذشته و دلیل شهرتش، آغاز می گردد. شیوه غیر منتظره خوش آمد گویی و تبریک تولد یازده سالگی از طرف یک غول مهربان و آشنایی با دنیای جادوگران، درس های منحصر به فرد و اساتید رنگارنگ در مدرسه غیر معمول او، همگی موجب می شوند تا هری عمیقاً در دنیای اسرار آمیزی فرو برود که پیش تر هرگز از وجود آن خبر نداشت و به سرنوشت باشکوه خود نزدیک تر شود.',
          explanationOfTheBook : 'داستان هری پاتر و سنگ جادو درباره‌ی پسری نوجوان است که در سیزده سالگی متوجه می‌شود که به دنیای دیگری تعلق دارد. او برای رسیدن و کشف دنیای جدیدش به مشکلاتی بر میخورد اما نهایتا موفق می شود که سوار قطار سریع السیر هاگوارتز،مدرسه‌ی جدیدش بشود. در نخستین کتاب این مجموعه هری با مدرسه، معلمان و دوستان جدیدش آشنا میشود. و در نهایت سنگی شگقت انگیز را پیدا می‌کند اما یافتن این کتاب برای اون مشکلاتی را در بر خواهد داشت.',
          writer : 'جی کی رولینگ',
          isLike : 0,
          pages : 350,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/harry",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf1.pdf",
          isReading : 0,
      })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 1,
          name : 'چشم هایش',
          categoryAge : 2,
          categorySubject : 1,
          abstraction : '«تو و امثال تو نمیتوانید این دستگاه را به هم بزنید. مگر این دستگاه به روی پای خودش ایستاده که شماها بتوانید واژگونش کنید؟آنهایی که نگهش میدارند، از قایم موشک بازی های شما هراسی ندارند. این دیو احتیاج به قربانی های زیاد دارد. اما من کسی را مرد میدان نمیبینم. میترسم عوض اینکه او را ضعیفتر کنید، از خونخواری پروارتر بشود و بی پروا به شما بتازد…»',
          explanationOfTheBook : 'چشمهایش را می‌توان یکی از کتاب‌های معروف و پرطرفدار دانست که کمتر کسی را می توان یافت که اهل مطالعه باشد اما این شاهکار هنری در لیست کتاب‌های خوانده شده  او نباشد. با اینکه رمان چشمهایش در حدود 67 سال پیش و فضای ادبی متفاوت با این دوران نوشته شده است، اما هنوز هم از پرفروش ترین رمان های فارسی به شما می رود. پس اگر اهل مطالعه هستید و هنوز نسبت به خرید کتاب چشمهایش اقدام نکرده اید، فیدیبو این کتاب بی نظیر را به شما معرفی می‌کند.',
          writer : 'بزرگ علوی',
          isLike : 0,
          pages : 800,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/cheshmhayash",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf2.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 2,
          name : 'هیچ دوستی به جز کوهستان',
          categoryAge : 2,
          categorySubject : 1,
          abstraction : 'برای موونس و جنتو دوستانم که در مسیر نوشتن این کتاب همراهم بوده‌اند.بدون آن‌ها این مسیر این‌گونه طی نمی‌شد.نجم الدین ویسی که هم‌فکری با او کمک زیادی کرد که بتوانم ابعاد ناشناخته‌ی سیستم زندان مانوس را بهتر درک کنم و همین طور فرهاد بوچانی',
          explanationOfTheBook : 'هیچ دوستی به جز کوهستان که در انگلیسی به نام «no friend but the mountains» داستان سال‌های اقامت بهروز بوچانی نویسنده‌ی ایرانی است که در جریان پناهندگی به استرالیا دستگیر شد. او در طی 5 سال کتابش را در واتساپ می‌نوشت و برای دوستش امید توفیقیان می‌فرستاد. امید توفیقیان نوشته‌های او را به انگلیسی برگرداند و درنهایت سال 2018 کتاب هیچ دوستی به‌جز کوهستان را منتشر کرد. این کتاب به نام رفیقی نه مگر کوهستان نیز شناخته می‌شود.',
          writer : 'بهروز بوچانی',
          isLike : 0,
          pages : 700,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/kohestan",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf3.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 3,
          name : 'چه کسی از دیوانه‌ها نمی‌ترسد؟',
          categoryAge : 2,
          categorySubject : 1,
          abstraction : 'من میخواهم صحنه‌هایی را به تو نشان دهم که مثل سیلی به صورتت بخورد. می‌توانی نگاه نکنی، می‌توانی خاموش کنی، می‌توانی هویت خود را پنهان کنی، مثل قاتل‌ها، اما نمی‌توانی جلوی حقیقت را بگیری، هیچ کس نمی‌‎تواند.',
          explanationOfTheBook : 'کتاب چه کسی از دیوانه‌ها نمی‌ترسد اولین اثر مهدی رضایی، نویسنده و بنیان‌گذار «کانون فرهنگی چوک» است. این کتاب را «نشر افکار» سال 89 در ایران منتشر کرده است.مهدی رضایی داستانش را در 6 فصل نوشته است. داستانی که راوی آن آرمان پاکروان، همان دیوانه‌ی داستان، یک معلم دبیرستان است و ماجراهای مختلفی از قتل و خیانت و عاشقی را بیان می‌کند. برهمکنش میان آرمان و همسرش روزنامه‌نگارش نگار، همسایه‌ای وبلاگ نویس به نام آقای شاهی، شخصیت خیالی‌ای به نام نسترن که راوی در ذهنش با او حرف می‌زند و شخصیت‌های دیگر، تکه‌های پازل مهدی رضایی را شکل می‌دهند.',
          writer : 'مهدی رضایی',
          isLike : 0,
          pages : 20,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/divaneha",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf4.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 4,
          name : 'دایی‌جان ناپلئون',
          categoryAge : 2,
          categorySubject : 1,
          abstraction : 'رمان دایی‌ جان ناپلئون نتیجه‌ی تلفیق داستان عشق ناکام نویسنده با ماجراهای خانوادگی او است. روایت پسری عاشق پیشه به نام سعید است که عاشق دختر دایی‌اش لیلی می‌شود. خانواده‌ی سعید همراه با خانواده دایی‌ جان و چند خانواده‌ی دیگر در باغی بزرگ و چند عمارتی زندگی می‌کنند. ایرج پزشکزاد نویسنده کتاب می‌گوید باغی که داستان در آن روایت می‌شود الهام گرفته شده از باغی است که پزشکزاد کودکی‌اش را در آن گذرانده است. باغی که ارث مادری‌اش بوده و همراه خاله‌ها و دایی‌هایش در آن زندگی می‌کردند.',
          explanationOfTheBook : 'طنزنویسی در ادبیات ایران سابقه‌ای دیرینه‌ دارد. از زمانی که «عبید زاکانی» منظومه «موش و گربه» را سرود تا امروز، آثار طنز ماندگاری در ادبیات فارسی نوشته شده است. تعداد زیادی از این آثار طنز از سلاح قلم برای بیان ضعف‌های جامعه استفاده کرده‌اند و این شیوه‌ی نقد اجتماعی از ادبیات کلاسیک به ادبیات معاصر هم رسیده است. دایی جان ناپلئون به قلم ایرج پزشکزاد منحصربه‌فردترین داستان معاصر فارسی است که با زبانی طنز مردم و آداب و رسوم عامیانه‌ی جامعه‌ی دهه‌ی چهل ایران را نقد کرده است. ',
          writer : 'ایرج پزشک‌زاد',
          isLike : 0,
          pages : 100,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/napelon",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 5,
          name : 'یک عاشقانه آرام',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : 'رمان دایی‌ جان ناپلئون نتیجه‌ی تلفیق داستان عشق ناکام نویسنده با ماجراهای خانوادگی او است. روایت پسری عاشق پیشه به نام سعید است که عاشق دختر دایی‌اش لیلی می‌شود. خانواده‌ی سعید همراه با خانواده دایی‌ جان و چند خانواده‌ی دیگر در باغی بزرگ و چند عمارتی زندگی می‌کنند. ایرج پزشکزاد نویسنده کتاب می‌گوید باغی که داستان در آن روایت می‌شود الهام گرفته شده از باغی است که پزشکزاد کودکی‌اش را در آن گذرانده است. باغی که ارث مادری‌اش بوده و همراه خاله‌ها و دایی‌هایش در آن زندگی می‌کردند.',
          abstraction : 'حتماً با خواندن مقدمه کتاب چنین برداشتی خواهید داشت که با یک کتاب پر از واژه های عاشقانه مواجه خواهید شد و از ابتدا تا انتهای کتاب عاشقانه های رویایی که در ذهن نویسنده وجود دارد را مطالعه خواهید کرد. اما اگر این برداشت شما از این داستان است باید دید خود را تغییر دهید چرا که نادر ابراهیمی با پرداختن به یک داستان واقع گرایانه عاشقانه هایی که به دل می نشیند را در دل داستان قرار داده است.',
          writer : 'نادر ابراهیمی',
          isLike : 0,
          pages : 239,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/yekAsheghaneAram",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 6,
          name : 'آذرخش',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : '«آذرخش» داستان زندگی دختری به‌نام سارا آذرخش است که در کودکی در سانحه رانندگی پدر و مادرش را از دست می‌دهد. سارا بعد از این اتفاق به‌همراه پدربزرگ‌، مادربزرگ و دایی‌اش زندگی می‌کند. تکیه‌گاه و مشوق اصلی او در زندگی دایی‌اش بهرام است. سارا که حالا استاد دانشگاه و مترجم است ماجرایی عاشقانه دارد که البته در مقابلِ داستانِ عاشقانۀ بهرام با پیچیدگی کمتری روبه‌رو است. آنچه به ارزش داستانی رمان آذرخش افزوده وجه آموزنده و روان‌شناختیِ آن است. این رمان عاشقانه ایرانی برای مخاطبانی که از رمان چیزی بیش از فرازوفرود یک داستان انتظار دارند انتخاب مناسبی است.',
          abstraction : 'حرف بزن عزیزم، حرف بزن. تا ابد حرف بزن. دوست دارم تو بگویی و من گوش کنم، تو بخندی و من لذت ببرم، تو راه بروی و من تماشا کنم. دوستت دارم، بیش از آنکه فکرش را بکنی، به مراتب بیشتر از آنکه در ذهنت بگنجد در قلب من فضا داری. همه عشقم، روحم، جانم، وجودم متعلق به توست. تو نیمه گمشده منی، گمشده‌ای که پیدا شده است و من خیال ندارم از دستش بدهم. بگو از دنیا چه می‌خواهی؟ همه را برایت می‌آورم، حتی اگر لازم باشد برای به دست آوردنش به آن‌سوی قله کوه قاف بروم.',
          writer : ' لیلا رعیت',
          isLike : 0,
          pages : 239,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/azarakhsh",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 7,
          name : ' شوهر آهو خانم',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : 'رمان «شوهر آهو خانم» از معروف‌ترین رمان های عاشقانه ایرانی است که قبل از انقلاب منتشر شده است. نکته جالب درمورد این رمان وضعیت نویسنده در هنگام نگارش کتاب بوده است؛ علی‌محمد افغانی این رمان را زمانی نوشت که در زندان بود.رمان به‌خوبی عشق و هوس و نجابت را در قالب شخصیت‌هایش برای مخاطب تصویر می‌کند. شوهر آهو خانم قصه عشق مرد میان‌سالی به‌نام سیدمیران است که با یک خیرخواهی آغاز می‌شود و بعد، از یک عشق آتشین سر درمی‌آورد. تا جایی که با وجود زن و ۴ فرزند برای دومین بار ازدواج می‌کند.',
          abstraction : 'فقر که می‌آید روابط هما و سید به هم می‌خورد. هما می‌خواهد طلاق بگیرد و سید، که شهوت از او دیوی ساخته‌است، آهوخانم را از خانه می‌راند و به او می‌گوید برود فاحشه‌خانه یا قبرستان. آهوخانم نیز در برابر این همه خواری نمی‌شورد، بردگی این زندگی ذلیل را بی‌چون و چرا می‌پذیرد، چون جامعه او را صاحب حقی نمی‌داند. آهوخانم خانه را ترک می‌کند و به ده می‌رود و سید به فکر می‌افتد که با هما به سفری بی‌برگشت برود. آهوخانم وقتی خبردار می‌شود، صبر و بی‌تفاوتی را به کناری می‌نهد، خود را به گاراژ می‌رساند و سید را با فضیحت به خانه برمی‌گرداند. این است آن آگاهی که درموردش صحبت کردیم: سیر داستان، زن بینوا را از تحمل خفت و خواری برحذر می‌دارد و از او می‌خواهد برای حفظ زندگیش به مقابله برخیزد. هما با راننده اتومبیل شهر را ترک می‌کند. زن نگون‌بخت جز در به دری چاره‌ای ندارد. زندگی‌اش سرابی است ملال‌خیز و بی‌سرانجام. آهوخانم شاد از بازیافتن شوهر، می‌رود تا بار دیگر زندگی درهم شکسته‌ای را سامان بخشد.',
          writer : 'علی‌محمد افغانی',
          isLike : 0,
          pages : 800,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/aho",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 8,
          name : 'قهوه سرد آقای نویسنده',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : 'روزبه معین نویسنده جوانی است که کتاب «قهوه سرد آقای نویسنده» اولین اثر منتشرشده اوست. درمورد این کتاب اولین نکته‌ای که جلب توجه می‌کند رسیدن به چاپ ۸۰ است، در مدت ۳ سال پس از انتشار. داستان درمورد پسری است که در کودکی عاشق دختری می‌شود که ۱۵ سال از خودش بزرگ‌تر است و برای آموزش پیانو به خانه پیرزن همسایه‌شان می‌آید. این همۀ داستان نیست و ما با نویسنده، به بزرگ‌سالی او می‌رویم و آنجا ماجرای اصلی رخ می‌دهد. جملات زیبا و فضای رازآلود کتاب از جمله نقاط قوت آن است که توانسته توجه مخاطبان را به خود جلب کند.',
          abstraction : 'بهم گفت: «تا حالا شکار رفتی؟» گفتم «نه.» گفت: «من قبلا می‌رفتم، ولی دیگه نمی‌رم، آخرین باری که شکار رفتم، شکار گوزن بود، خیلی گشتم تا یه گوزن پیدا کردم. من بهش شلیک کردم، درست زدم به پاش، وقتی رسیدم بالای سرش هنوز جون داشت، نفس می‌کشید و با چشم‌هاش التماس می‌کرد، زیباییش مسخم کرده بود، حس کردم که می‌تونه دوست خوبی واسه‌م باشه، می‌تونستم نزدیک خونه یه جای دنج واسه‌ش درست کنم. اما خوب که فکر کردم فهمیدم که این‌جوری اون گوزن واسه همیشه لنگ می‌زنه و هروقت من رو ببینه یاد بلایی می‌افته که سرش آوردم، از نگاهش فهمیدم بزرگ‌ترین لطفی که می‌تونم در حقش بکنم اینه که یه گلوله صاف تو قلبش شلیک کنم.» بعدش گفت: «تو هیچ‌وقت نمی‌تونی با کسی که بدجور زخمیش کردی دوست باشی.»',
          writer : 'روزبه معین',
          isLike : 0,
          pages : 220,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/ghahveSard",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 9,
          name : 'همخونه',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : '«همخونه» کتابی است که نویسنده‌اش، مریم ریاحی، با آن به شهرت رسید. داستان کتاب درمورد دختری به‌نام یلدا است که بعد از ازدست‌دادن پدر و مادرش نزد حاج رضا، دوست پدرش، زندگی می‌کند. حاج رضا، که فقط یکی از فرزندانش به‌نام شهاب در ایران زندگی می‌کند، سعی دارد یلدا و شهاب را به هم نزدیک کند. ‌او با یک شرط یلدا و شهاب را به عقد هم درمی‌آورد و قرار است به‌صورت توافقی ازدواج و به‌مدت ۶ ماه باهم در یک خانه زندگی کنند. این هم‌خانه بودن چالش‌ها و ماجراهایی برای یلدا و شهاب در پیش دارد که قصه همخونه از آنجا آغاز می‌شود.',
          abstraction : 'ظهر بود اواخر شهریور با این که هوا کم کم روبه خنکی می رفت اما آن روز به شدت گرم بود خورشید با قدرتی هر چه تمام تر به پیشانی بلند و عرق کرده ی حسین آقا می تابید قطره های ریز و درشت عرق از سر روی او آرام آرام و پشت سرهم ریزان بودند و روی صورتش را گرفته بودند چهره ی آفتاب سوخته اش زیر نور خورشید برق می زد اما گویی اصلاً متوجه گرما نبود و همان طور شیلنگ آب را روی سنگ فرش حیاط بزرگ و زیبای حاج رضا گرفته بود و به نظر می رسید قصد دارد آن‌ها را برق بیاندازد.',
          writer : 'مریم ریاحی',
          isLike : 0,
          pages : 456,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/hamkhone",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 10,
          name : 'بامداد خمار',
          categoryAge : 2,
          categorySubject : 0,
          explanationOfTheBook : 'رمان «بامداد خمار» از معروف‌ترین رمان های عاشقانه ایرانی معاصر است که در یک دهه بیش از ۳۰۰هزار نسخه‌اش فروش رفت. همین نشان‌دهنده محبوبیت این رمان در میان مخاطبان است. داستان درباره دختری به‌نام محبوبه‌ است که در زمان حال، ماجرای خود را برای برادرزاده‌اش سودابه که در دوراهی مشابه تجربه خودش در جوانی است تعریف می‌کند. ماجرای عاشقانۀ او در جوانی و سرنوشتی که این عشق برای او رقم می‌زند داستان اصلی کتاب است. محبوبه دختری در طبقه بالای جامعه است که عاشق پسری نجار به‌نام رحیم از طبقه پایین می‌شود. او برای رسیدن به رحیم هزینه‌های گزافی می‌دهد که تبعات آن تا آخر عمر گریبان‌گیر اوست.',
          abstraction : 'كاغذي برداشتم. يك كاغذ تميز، يك قطره كوچك عطر به آن زدم. يادم نيست چه عطري بود. عطري بود كه مادرم به من داده بود. فرنگي بود. گرانقيمت بود. براي روزهاي خواستگاري بود. دور و بر كاغذ را گل كشيدم و رنگ كردم. روبان كشيدم. بلبل كشيدم. شايد يكي دو هفته طول كشيد. نقاشي مي‌كردم و فكر مي‌كردم چه كنم. عقلم مي‌گفت دست بكشم. ولي بيچاره نگفته مي‌دانست كه باخته است. مي دانست كه نمي‌توانم. مي‌خواستم به حرف عقلم گوش كنم. براي خودم هزار دليل و منطق آوردم. قسم مي خوردم كه نخواهم رفت. ولي انگار ميخ آهنين در سنگ مي كوبيدم. مي‌دانستم كه خواهم رفت. خود را با سنگ به مهلكه خواهم انداخت.',
          writer : ' فتانه حاج سید جوادی',
          isLike : 0,
          pages : 490,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/bamdadKhomar",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 11,
          name : 'کلیله و دمنه',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'کتاب "کلیله و دمنه" حدود دو هزارسال پیش به وسیله یکی از دانشمندان هندی به زبان سانسکریت نوشته شده است برزویه طبیب از دانشمندان زمان خسرو انوشیروان پادشاه ساسانی این کتاب را از هند به ایران آورد و به زبان پهلوی ترجمه کرداین کتاب دارای حکایات ارزشمند اخلاقی و روش های زندگی است که از زبان دو شغال به نام کلیله و دمنه نقل شده استو در آن سعی شده حکایت های آموزنده و دارای نکات ارزنده به صورت ساده و قابل استفاده برای کودکان و نوجوانان بازنویسی شود تا مورد استفاده این عزیزان قرار گیرد.',
          abstraction : 'در روزگاران قدیم در دامنه ی کوهی بزرگ درختان زیادی وجود داشت که در بالای آنها پرندگان زیادی لانه داشتند در میان آنها کلاغ و کبکی بودند که تازه به آن محل آمده بودندو خیلی زود بایکدیگر دوست صمیمی شدند.یک روز صبح زود کبک برای آوردن غذا بیرون رفت و باز نگشت چند روزی گذشت و از او خبری نشد کلاغ همه جارا گشت و از او اثری پیدا نکرد باخود گفت:شاید نتوانسته راه باز گشت را پیدا کند و گم شده است یا در جای دیگری لانه ساخته است.کلاغ که دیگر تنها شده بود خود را به کار کردن مشغول کرد تا جای خالی دوست خود را کمتر احساس کند اتفاقا موشی از آنجا می گذشت و لانه خالی کبک را دید خوشش آمد و تصمیم گرفت همانجا زندگی کند.',
          writer : 'علیرضا طاهری',
          isLike : 0,
          pages : 20,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/kelileDemne",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 12,
          name : 'قصه های شیرین مادربزرگ',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'قصه و داستان وسیله و روشی برای تعلیم و تربیت فرزندان و آموزش مهارت های زندگی و انتقال گنجینه ی ارزشمند میراث فرهنگی به آنها می باشدقصه و داستان کودکان را به دنیای دیگری می برد و باشخصیت های خاصی آشنا می کند که گاه سبب می شود تا مدت ها در آن فضا سیر کنند و از آن جا که در محیط خانه و خانواده صورت می گیرد با احساس آرامش همراه بوده و تکرار آن برای کودکان لذت بخش است.',
          abstraction : 'روزی بود و روزگاری بود، در شهری دور جواهر فروشی الماس درخشانی را پیدا کرد و چون ارزش آن را می دانست در کیسه ای گذاشت و در صندوقچه آهنی پنهان کرد و به آن قفل فولادی زد تا از دست دزد در امان باشد . سپس به طرف شهر شام رفت تا آن را به قیمتی گران بفروشد، شب و روز از آن محافظت می کرد تا مبادا خراشی در آن ایجاد شود و از ارزشش کم شود کیسه ای که الماس درآن بود از جنس کرباس ساده ای بود و ارزش زیادی نداشت، روزها گذشت تا اینکه یک روز که کیسه کرباسی داشت با خود می گفت عجب جاه و مقامی دارم چقدر جواهر فروش از من محافظت می کند؟ چرا خودم نمی دانستم اینقدر مهم و باارزش هستم الماس که صحبت های کیسه را شنید، خنده ای کرد و گفت ای دوست عزیز شما خیلی مقام داری و با ارزش هستی،ولی بدان که تنها نیستی. ..',
          writer : 'معصومه طاهری',
          isLike : 0,
          pages : 20,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/madarbozorg",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 13,
          name : 'پسرک، موش کور، روباه و اسب',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'کتاب پسرک، موش کور، روباه و اسب نوشته چارلی مکسی، قصه یک پسر بچه در کنار حیوانات را روایت می‌کند و سعی دارد نکات آموزنده‌ای را به کودکان آموزش دهد. این اثر که در سال 2019 به عنوان کتاب سال واتر استونز انتخاب شد و به عنوان پرفروش‌ترین کتاب در نیویورک‌تایمز، وال‌استریت ژورنال و یو اس ای تو دی نیز شناخته شد.',
          abstraction : 'موش کور گفت: «گاهی دوست دارم بگم عاشق همه‌تونم. ولی می‌بینم برام خیلی سخته.» پسرک گفت: «واقعاً؟» «آره، واسه‌ی همین یه چیز دیگه می‌گم، مثلاً می‌گم خوشحالم که همه‌مون با هم اینجاییم.» پسرک گفت: «باشه.» «خوشحالم که همه‌مون با هم اینجاییم.» «ما هم از این که تو اینجا با مایی خیلی خوشحالیم.»',
          writer : 'چارلی مکسی، سید وحید کریمیان',
          isLike : 0,
          pages : 20,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/moshKor",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 14,
          name : 'شکل جدید دوستی',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'دایره و مربع دو دوست صمیمی و جدا نشدنی هستند. دایره زاویه‌های بی‌نظیر مربع را تحسین می‌کند و مربع هم به این که دایره به راحتی می‌توانست حرکت کند و چرخ بزند افتخار می‌کرد. آن‌ها دوستی بی‌مانندی داشتند تا زمانی که سر و کله یک مثلث جسور و تیز میان آن‌ها پیدا شد. دایره و مربع هر کدام به نحوی می‌خواستند با مثلث دوست شوند و توجه او را به خود جلب کنند، اما هر کاری که دایره و مربع برای جلب توجه مثلث می‌کردند، باعث می‌شد تا روابط میان آن دو تیره‌تر شود. مربع و دایره آنقدر به خاطر مثلث با هم دعوا کردند که خون مثلث به جوش آمد و یک تصمیم عجیب گرفت.',
          abstraction : 'دایره تمام گوشه‌های خاص مربع را تحسین می‌کرد و مربع عاشق این بود که دوستش واقعا می‌دانست چطور این طرف و آن طرف بپرد. تا زمانی که شیء تیزی میان آن‌ها قرار گرفت. آن شیء چیزی نبود جز یک مثلث جسور و هیجان انگیز. در ابتدا چیزهای کوچک شروع کردند به تغییر کردن، مثلا غذا خوردن. دوست داری این ساندویچ پنیر را باهم قسمت کنیم؟ نه ممنون. من هوس پیتزا کرده‌ام.',
          writer : 'مارسی کالین، نوید خداوندی',
          isLike : 0,
          pages : 20,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/shekleDosti",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 15,
          name : 'برگ های بازیگوش',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'یک روز زیبا خرس کوچولو از خواب بیدار شد و تصمیم گرفت لباس‌هایش را بشوید. پس سطلی با خود برد تا از رودخانه آب بردارد؛ چندین برگ به درون سطل افتادند. همینطور که خرس کوچولو در جنگل به راهش ادامه می‌داد برگ‌های زیادی دید که همه‌جا هستند. خرس کوچولو نزد جغد دانا رفت تا علت ریختن این برگ‌های زرد را بداند...',
          abstraction : 'در یک صبح پاییزی خرس کوچولو از خواب بیدار شد و چند بار خمیازه کشید. به آفتاب نگاه کرد و با خودش گفت: امروز هوا خیلی خوب است، بهتر است دست به کار شوم و تمام لباس‌هایم را بشورم.',
          writer : 'چیان یی لین، آرزو رمضانی',
          isLike : 0,
          pages : 30,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/barghayeBazigosh",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 16,
          name : 'دلفین کوچولو',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'دلفین کوچولو همراه با مادرش در دریاها و اقیانوس‌ها زندگی می‌کرد. آن‌ها هر روز با هم شنا می‌کردند و دنبال غذا می‌گشتند. روزی آن‌ها برای شرکت در جشن سالانه‌ی اقیانوس در حال آماده شدن بودند که در راه دسته‌ای از ماهی‌های ساردین را دیدند و در همین حین، دلفین کوچولو کوسه‌ای را در نزدیکی خودش دید...',
          abstraction : 'من یک دلفین هستم. در دریاها و اقیانوس‌ها زندگی می‌کنم. من هر روز با مادرم در دریا شنا می‌کنم و دنبال غذا می‌گردم. مهارت زیادی در شنا کردن دارم. حتماً در پارک‌های آبی مرا دیده‌اید که نمایش‌های جالبی انجام می‌دهم.',
          writer : 'چیان یی لین، آرزو رمضانی',
          isLike : 0,
          pages : 40,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/dolfin",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 17,
          name : 'بهترین داستان‌های وقت خواب',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'کتاب (My favourite bedtime stories) برای کودکان سال‌های آغاز دبستان که علاقه‌مند به داستان‌های حیوانات هستند، مناسب خواهد بود. تصاویر رنگی و هیجان‌انگیز این کتاب آنقدر برای کودک جذاب است که حتی از ورق زدن آن هم لذت می‌برد.',
          abstraction : 'سام برای اولین بار می‌خواست به یک مهمانی شب مانی خانه دوستش برود. او خیلی هیجان زده بود، اما کمی هم نگران بود. به مامان گفت: «قراره توی یک تخت عجیب و غریب بخوابم. اگه دوست نداشته باشم، چی؟» مامان جواب داد: «نگران نباش، میتونی خرس کوچولوی زردت رو ببری و شب بغلش کنی، اون خیلی پشمالو و نرمه!»',
          writer : 'گروه نویسندگان، شهرزاد امینیان',
          isLike : 0,
          pages : 50,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/vaghteKhab",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 18,
          name : 'قصه‌هایی برای شاهزاده خانم‌ها',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'کتاب قصه‌هایی برای شاهزاده خانم‌ها (Bedtime stories for princesses) داستان‌های آموزنده و جالبی دارد و می‌تواند کودکان را به خوبی سرگرم کند. این کتاب تصاویر بسیار زیبایی دارد که به جذابیت داستان‌ها اضافه می‌کند. شما در طول مطالعه‌ی کتاب قصه‌هایی برای شاهزاده خانم‌ها با انواع و اقسام موجودات جادویی مانند تک‌شاخ‌ها، پری‌های دریایی و ... آشنا می‌شوید که به جذابیت داستان‌ها می‌افزایند.',
          abstraction : 'خیلی زود وقت آن رسید که فیبی به خانه برگردد. فیبی پشت رخشان سوار شد و در حالی که برای پری‌ها دست تکان می‌داد، داد زد: «خداحافظ پری‌های مهربان». پری‌ها هم لبخند زدند و دست تکان دادند و در جواب گفتند: «باز هم به اینجا سر بزن».',
          writer : 'گروه نویسندگان، مهدی رمضانی',
          isLike : 0,
          pages : 60,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/shahzadeKhanom",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 19,
          name : 'قصه‌های شب برای پسر‌های کوچولو',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'کتاب قصه‌هایی برای شاهزاده خانم‌ها (Bedtime stories for princesses) داستان‌های آموزنده و جالبی دارد و می‌تواند کودکان را به خوبی سرگرم کند. این کتاب تصاویر بسیار زیبایی دارد که به جذابیت داستان‌ها اضافه می‌کند. شما در طول مطالعه‌ی کتاب قصه‌هایی برای شاهزاده خانم‌ها با انواع و اقسام موجودات جادویی مانند تک‌شاخ‌ها، پری‌های دریایی و ... آشنا می‌شوید که به جذابیت داستان‌ها می‌افزایند.',
          abstraction : 'خیلی زود وقت آن رسید که فیبی به خانه برگردد. فیبی پشت رخشان سوار شد و در حالی که برای پری‌ها دست تکان می‌داد، داد زد: «خداحافظ پری‌های مهربان». پری‌ها هم لبخند زدند و دست تکان دادند و در جواب گفتند: «باز هم به اینجا سر بزن».',
          writer : 'مهدی رمضانی',
          isLike : 0,
          pages : 60,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/pesahayeKocholo",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 20,
          name : 'خرگوش باهوش و قصه‌های دیگر',
          categoryAge : 0,
          categorySubject : 1,
          explanationOfTheBook : 'داستان خرگوش باهوش که حکایت اصلی و نخست این مجموعه‌ی جذاب و خواندنی است، قصه‌ی جنگلی را روایت می‌کند که در آن تمامی حیوانات با هم خوب هستند و هیچ‌کس دیگری را نمی‌خورد. با این حال یک استثنا وجود دارد و آن هم شیر بدجنس و زورگویی است که همه را می‌کشد. اوضاع بر همین منوال پیش می‌رود تا این‌که صبر همه‌ی حیوانات تمام می‌شود و تصمیم می‌گیرند اقدامی صورت دهند.',
          abstraction : 'گوزن با خودش فکر کرد: «چه دوستان خوبی دارم! وقتی متوجه شدند که به کمک نیاز دارم، تمام آن‌ها آمدند تا به من کمک کنند.» درست وقتی گوزن داشت به دوستانش فکر می‌کرد، کلاغ به همه هشدار داد که شکارچی دارد به آن‌ها نزدیک می‌شود.',
          writer : 'علی محمدپور',
          isLike : 0,
          pages : 60,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/pandAmoz",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 21,
          name : 'بابا لنگ دراز | داستان زندگی جودی ابوت',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'جودی ابوت (جروشا ابوت) با آن موهای قرمز بافته شده‌اش، دختر مهربون و یتیم ولی در عین حال شاد و باهوشی است که پدر و مادرش را زمانی که هنوز کودکی بیش نبود، از دست داد. او در خیابان بسون در نیویورک سیتی پیدا و به یتیم خانه جان گیر منتقل شد، جایی که او توانایی خود برای نوشتن را کشف کرد. یکی از مقالات او توجه وکیلی به نام «جان اسمیت» را جلب می‌کند و بدون آنکه جودی او را بشناسد، جان به او اجازه می‌دهد تا تحصیلات خود را برای حضور در دبیرستان یادبود لینکلن ادامه دهد.',
          abstraction : 'این مشکلات بزرگ در زندگی نیست که نیاز به شخصیت دارند. هر کس می‌تواند به بحرانی برسد و با یک جر و بحث خرد‌کننده مواجه شود، اما برای رفع خطرات روزافزون تنها با خنده؛ من واقعا فکر می‌کنم خنده نیاز روح است. این نوع شخصیت است که من قصد دارم آن را توسعه دهم. من قصد دارم وانمود کنم که تمام زندگی فقط یک بازی است که من باید به طرز ماهرانه و منصفانه به همان اندازه که می‌توانم بازی کنم. اگر من شکست بخورم، شانه هایم را بالا می‌اندازم و می‌خندم، همچنین اگر من برنده هم شوم.',
          writer : 'جین وبستر',
          isLike : 0,
          pages : 60,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/babalengderaz",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 22,
          name : 'حماسه ویچرآخرین آرزو',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'یک فانتزی واقعگرایانه. جلد اولش نسخه چاپی ویچر رو خوندم و باید بگم کتاب فانتزی دیگه ای منو وسط خوندن انقدر به فکر فرونمیبرد. خصوصا فصل "بد و بدتر" کتاب. دم انتشارات و مترجم هم گرم که ترجمه ی به این خوبی ارائه داده. بعید میدونم سانسوری صورت گرفته باشه اصلا :)) از فیدیبو هم ممنونیم که اهمیت داد و این کتاب رو اضافه کرد',
          abstraction : 'نزدیک های صبح پیش او آمد.  خیلی محتاطانه وارد شد، بی صدا حرکت می کرد، مانند شبحی در هوا معلق بود؛ تنها صدای اتاق متعلق به ردای دختری بود که به بدنش کشیده می شد؛ اما همین صدای ضعیف هم کافی بود ویچر را بیدار کند، شاید هم او را از نیمه هوشیاری یکنواختش بیرون کشیده بود، گویی داشت در اعماق ژرف دریا سفر می کرد، شناور میان کف دریا و سطح آرام آن، در میان شاخه های گیاهان دریایی که آهسته موج می زدند. ',
          writer : 'آنجی سپکوفسکی',
          isLike : 0,
          pages : 60,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/vicher",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 23,
          name : 'ماجراهای تن‌تن و میلو',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'این کتابچه راهنمای کاملی درباره تن‌تن و ماجراهای هیجان‌انگیزش است. بعید به نظر می‌رسد کسی اسم تن‌تن را نشنیده باشد،‌ او شخصیت اصلی یکی از مشهورترین کتاب‌های کمیک‌های جهان است که سالهاست محبوبِ اهالی ادب و فرهنگ است. در این کتابچه شما زندگی نامه هرژه، روند شکل‌گیری شخصیت‌های تن‌تن و داستان‌های او آشنا می‌شوید. در مقدمه این کتاب می‌خوانیم: «تن‌تن همه‌مان را عاشق خبرنگاری کرد!» این جمله‌ای است که هندی بروس خبرنگار نیویورک تایمز درباره تن‌تن گفته است. جمله‌ای که می‌تواند حس و حال همه طرفداران تن‌تن را بیان کند حتی آن‌هایی که شانس این را نیافتند تا مثل قهرمان محبوب‌شان خبرنگار شوند. برای طرفدار تن‌تن بودن هیچ آداب و ترتیبی لازم نیست! ',
          abstraction : 'اما همه مان توافق داریم که مهم ترین عامل محبوبیت تن تن شخصیت پردازی است. بسیاری از شخصیت هایی که در کتاب های تن تن آمده اند تبدیل به قهرمان هایی ماندگار برای نسل های مختلف شده اند. اما همین شخصیت های ماندگار هم هر کدام برای خود ماجراهای جالبی دارند. شاید به خاطر وجود همین ماجراهاست که این شخصیت ها تا این حد مورد توجه قرار گرفته اند. برای نمونه کارآگاه های دوقلوی این ماجراها یعنی دوپونت و دوپونط',
          writer : 'فیدیبو',
          isLike : 0,
          pages : 600,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/tantan",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 24,
          name : 'بینوایان',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'از ویکتور هوگو حدود پنجاه اثر به یادگار مانده، اما بی شک بینوایان شاهکار اوست. او در این اثر روابط اجتماعی، جغرافیا و بخشی خاص از تاریخ فرانسه را به شیوه اعجاب‌انگیز به تصویر می‌کشد. ژان والژان برای سیر کردن هفت فرزند گرسنه خواهرش قرصی نان می‌دزدد و نوزده سال در زندان اسیر می‌شود. پس از آزادی زندگی‌اش را وقف نیازمندان و کوزت، دختری یتیم، می‌کند اما بازرس ژاور نماینده قانون، همه جا در تعقیب اوست.',
          abstraction : 'نوزده ساله بود که مادرش درگذشت و یک سال بعد، هوگو نخستین مجموعه ی اشعارش را منتشر کرد. این مجموعه مورد پسند لویی شانزدهم، پادشاهِ وقت فرانسه قرار گرفت و برای هوگو هزار و دویست فرانک مقررّی سالیانه برقرار کرد. به همین جهت هوگو در این سال توانست با ادل ازدواج کند و ثمره ی ازدواج شان پنج فرزند بود که یکی از آن ها درگذشت. ',
          writer : 'ویکتور هوگو',
          isLike : 0,
          pages : 100,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/binavayan",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 25,
          name : 'اسمورف‌های بنفش',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : '"سرزمین اِسمورف ها " از اینجا خیلی خیلی دور است و تا به حال هیچ انسانی نتوانسته است به آنجا برود. اینجا جایی است که اسمورف‌ها زندگی می‌کنند. آن‌ها به اندازه‌ی کوچک و پوست آبی رنگی دارند و به علاوه زبان خاص خود را هم دارند: آن‌ها "اسمورفی" صحبت می‌کنند. ...',
          abstraction : '',
          writer : 'پیو',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/esmorf",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 26,
          name : 'اسکارلت و آیوی ۱دوقلوی گمشده',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'یک مدرسه شبانه روزی وهم آور در نیمه شب،یک دفتر خاطرات سری،یک معلم وحشت آفرین،و معمایی پشت آدم را می لرزاند اما باید حل شود... وقتی اسکارلت،خواهر دوقلو و دردسر ساز آیوی خجالتی در مدرسه رووک وود ناپدید می شود،از ایوی دعوت می کنند جای او را بگیرد.آیوی باید مثل اسکارلت فکر کند و اسکارلت بشود.آیوی مصمم به حل معمای ناپدید شدن خواهرش قبول می کند،و جستجوی حقیقت خیلی بیشتر از آنکه انتظار دارد پرمخاطره از آب در می آید.',
          abstraction : '',
          writer : 'سوفی کلورلی',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/eskarlet",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 27,
          name : 'ماهی سیاه کوچولو ',
          categoryAge : 1,
          categorySubject : 1,
          explanationOfTheBook : 'نوشتن داستان‌های تاثیرگذار و ماندگار برای کودکان کار دشواری است، اما دشواری نوشتن در این حوزه زمانی به اوج می‌رسد که نویسنده‌ای تصمیم بگیرد مفاهیم عمیق و فلسفی را در قالب زبان، فهم و ادراک کودکان بیان کند، کاری که برتولت برشت، نویسنده‌ی آلمانی در آن تبحر داشت.',
          abstraction : 'ناگهان صدای زیر قورباغه‌ای او را از جا پراند. قورباغه لب برکه، روی سنگی نشسته بود؛ جست زد توی آب و آمد پیش ماهی و گفت: « من اینجام، فرمایش؟» ماهی گفت:« سلام، خانم‌بزرگ! قورباغه گفت:« حالا چه وقت خودنمایی‌ست، موجود بی اصل و نسب! بچه‌گیر آورده‌یی و داری حرف‌های گنده گنده می‌زنی! من دیگر آنقدر‌ها عمر کرده‌ام که بفهمم دنیا همین برکه‌ست. بهتر است بروی دنبال کارت و بچه‌های مرا از راه به در نبری. ماهی کوچولو گفت:« صدتا از این عمرها هم که بکنی، بازهم بک قورباغه‌ی نادان و درمانده بیشترنیستی. قورباغه عصبانی شد و جست زد طرف ماهی سیاه کوچولو، ماهی تکان تندی خورد و مثل برق در رفت و لای و لجن و کرم‌های ته برکه را بهم زد.  نخ سفیدی می‌دیدی. یک‌جا تخته‌سنگ بزرگی از کوه جدا شده بود و افتاده بود ته دره، و آب را دو قسمت کرده بود. مارمولک درشتی، به اندازه‌ی کف دست، شکمش را به سنگ چسبانده بود. از گرمی آفتاب لذت می‌برد و نگاه می‌کرد به خرچنگ گردو درشتی که نشسته بود روی شن‌های ته آب، آنجا که عمق آب کمتر بود، و داشت قورباغه‌ای را که شکار کرده‌ بود،می‌خورد ماهی کوچولو ناگهان چشمش افتاد به خرچنگ و ترسید؛ از دور سلامی کرد. خرچنگ چپ چپ به او نگاهی کرد و گفت:« چه ماهی با ادبی! بیا جلو کوچولو، بیا!» ',
          writer : 'صمد بهرنگی',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/mahi",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 28,
          name : 'زنان کوچک عاشقانه‌های کلاسیک ',
          categoryAge : 1,
          categorySubject : 0,
          explanationOfTheBook : 'ادبیات کلاسیک مملو از آثاری است که می‌توان با خواندن‌ آن‌ها به سال‌ها پیش سفر کرد و خود را در جای جای داستان‌ها تصور کرد و با دغدغه‌های آن‌ دوره‌ آشنا شد. از میان این آثار، رمان‌های زیادی هستند که می‌توان با آن‌ها در سنین کم به دنیای بزرگان سفر و زندگی آن‌ها را مجسم کرد. داستان زنان کوچک، داستانی شیرین و روان است که با خواندن آن می‌توان زندگی دخترانی را شناخت که در تلاش هستند بر مشکلات پیروز شوند.',
          abstraction : 'ناگهان صدای زیر قورباغه‌ای او را از جا پراند. قورباغه لب برکه، روی سنگی نشسته بود؛ جست زد توی آب و آمد پیش ماهی و گفت: « من اینجام، فرمایش؟» ماهی گفت:« سلام، خانم‌بزرگ! قورباغه گفت:« حالا چه وقت خودنمایی‌ست، موجود بی اصل و نسب! بچه‌گیر آورده‌یی و داری حرف‌های گنده گنده می‌زنی! من دیگر آنقدر‌ها عمر کرده‌ام که بفهمم دنیا همین برکه‌ست. بهتر است بروی دنبال کارت و بچه‌های مرا از راه به در نبری. ماهی کوچولو گفت:« صدتا از این عمرها هم که بکنی، بازهم بک قورباغه‌ی نادان و درمانده بیشترنیستی. قورباغه عصبانی شد و جست زد طرف ماهی سیاه کوچولو، ماهی تکان تندی خورد و مثل برق در رفت و لای و لجن و کرم‌های ته برکه را بهم زد.  نخ سفیدی می‌دیدی. یک‌جا تخته‌سنگ بزرگی از کوه جدا شده بود و افتاده بود ته دره، و آب را دو قسمت کرده بود. مارمولک درشتی، به اندازه‌ی کف دست، شکمش را به سنگ چسبانده بود. از گرمی آفتاب لذت می‌برد و نگاه می‌کرد به خرچنگ گردو درشتی که نشسته بود روی شن‌های ته آب، آنجا که عمق آب کمتر بود، و داشت قورباغه‌ای را که شکار کرده‌ بود،می‌خورد ماهی کوچولو ناگهان چشمش افتاد به خرچنگ و ترسید؛ از دور سلامی کرد. خرچنگ چپ چپ به او نگاهی کرد و گفت:« چه ماهی با ادبی! بیا جلو کوچولو، بیا!» ',
          writer : 'لوییزا می آلکوت',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/zananKochak",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 29,
          name : 'قصه های شیخ عطار',
          categoryAge : 1,
          categorySubject : 1,
          abstraction: 'روزی بود، روزگاری بود. یک روز سلطان محمود غزنوی با امیران لشکر خود به قصد شکار به صحرا رفت. در کنار تپه بی سرسبز و پر درخت که دیدن آن از دور آسان بود، قرارگاهی ترتیب دادند و چادر سلطان را بر سر پا کردند. خدمتکاران به تهیه ناهار مشغول شدند و لشکریان به دیدبانی را اگماشته شدند و امیران به دستور سلطان از هر طرف به شکار رفتند. خود سلطان محمود نیز سوار بر اسب از میان پست و بلند صحرا به جستجوی شکار رفت و به دنبال گورخری اسب تاخت تا از همراهان دور افتاد. و وقتی سلطان محمود از پشت تپه یی سر درآورد با پیرمرد خار کنی روبرو شد که خری همراه داشت و بار هیزمش افتاده بود و هرچه کوشش می‌کرد بار هیزم را روی خر خود بگذارد نمی‌توانست و در کار خود درمانده بود.',
          explanationOfTheBook : 'همه‌ی ما در کودکی تجربه‌ی شنیدن قصه‌هایی زیبا و خاطره‌انگیز را داشته‌ایم. قصه‌هایی که قبل از خواب پدر و مادر برایمان می‌خواندند یا از رادیو به آن‌ها گوش می‌دادیم. خیلی از این قصه‌های شیرین تا همیشه در ذهن ما ماندگار شدند. مهدی آذر یزدی اولین کسی بود که با مجموعه کتاب‌ قصه‌های خوب برای بچه‌های خوب ادبیات کهن ایران را برایمان ساده و دلنشین روایت کرد. با گذشت سالیان زیاد از انتشار مجموعه آثار او هنوز هم تازگی و جذابیت گذشته را دارند.',
          writer : 'مهدی آذر یزدی',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/atar",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 31,
          name : 'جهان در پوست گردو',
          categoryAge : 2,
          categorySubject : 2,
          abstraction: 'محتوای اصلی کتاب جهان در پوست گردو راجع‌به فیزیک نظری است. هاوکینگ در کتاب خود سعی کرده مفاهیم علمی را به شکلی ساده توضیح دهد تا مخاطب عام بتواند به درک درستی از آن دست پیدا کند. کتاب جهان در پوست گردو ابتدا به توضیح تاریخچه اصول فیزیک نوین می‌پردازد و سپس مطالبی در ارتباط با مکانیک کوانتومی و نظریه ریسمان را بیان می‌کند.',
          explanationOfTheBook : 'جهان در پوست گردو اثر استیون هاوکینگ را نیز باید جزو بهترین کتاب های علمی محسوب کنیم که در سال 2001 منتشر شد و توانست مورد توجه دانشمندان و محققان قرار بگیرد. این کتاب به زبان‌های مختلف ترجمه و در سراسر جهان منتشر شد. این اثر در ایران توسط مترجم‌های مختلفی ترجمه و عرضه شد.',
          writer : 'استیون هاوکینگ',
          isLike : 0,
          pages : 200,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/postgerdo",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 33,
          name : 'خط زمان',
          categoryAge : 2,
          categorySubject : 2,
          abstraction: 'البته نمی‌توان با توجه به سبک داستانی و تخیلی کتاب خط زمان، این اثر را یک کتاب تماما علمی به‌حساب بیاوریم؛ اما تلاش نویسنده در گنجاندن برخی از مطالب علمی در خط داستانی کتابش قابل تحسین است. بعد از موفقیت این اثر، فیلمی با همین نام در سال 2003 ساخته شد که مورد توجه قرار گرفت.',
          explanationOfTheBook : 'کتاب خط زمان اثر مایکل کرایتون اثری علمی-داستانی به‌حساب می‌آید که باید آن‌ را یکی از بهترین کتاب های علمی تاریخ محسوب کنیم. این کتاب که ابتدا در سال 1999 منتشر شد خیلی سریع به فروش بسیار بالایی دست پیدا کرد. بسیاری از مخاطبان و منتقدان معتقد بودند کرایتون با این اثر سعی کرده برخی از مفاهیم علمی را در قالب داستانی فانتزی و تخیلی به مخاطبش نشان دهد.',
          writer : 'مایکل کرایتون',
          isLike : 0,
          pages : 240,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/khatzaman",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
    realm.write(() => {
        realm.create('Books' , {
          id : 34,
          name : 'حیوانات ردیاب در حیات وحش',
          categoryAge : 2,
          categorySubject : 2,
          abstraction: 'کتاب حیوانات ردیاب در حیات وحش نوشته لیون گری است که با ترجمه مجید عمیق توسط انتشارات کانون پرورش فکری کودکان و نوجوانان منتشر شده است. این کتاب از مجموعه کتاب‌های حیوانات دانشمند است.',
          explanationOfTheBook : 'حیوانات برای زندگی دسته‌جمعی روش‌های گوناگونی دارند آن‌ها در اجتماعات خود قوانین خاص خود را دارند و برای گروه خود کارهای متفاوتی می‌کنند. بعضی از حیوانات مثل کوسه‌ها و دلفین‌ها می‌توانند از طریق صدا و امواج ردیابی کنند',
          writer : 'لیون گری',
          isLike : 0,
          pages : 140,
          imagePath : "https://murmuring-lake-55008.herokuapp.com/images/hayatvahsh",
          pdfPath : "https://murmuring-lake-55008.herokuapp.com/pdfs/pdf5.pdf",
          isReading : 0,
        })
    })
}

module.exports.writeData = writeData;